// --- 問題
// 正数Nを引数として受け取る関数pyramidを完成させよ
// ・N階層で#を使いピラミッド型にconsole.logする
// ・両端にスペースを入れること

// --- 例
//   pyramid(1)
//       '#'

//   pyramid(2)
//       ' # '
//       '###'

//   pyramid(3)
//       '  #  '
//       ' ### '
//       '#####'

//   pyramid(4)
//      '   #   '
//      '  ###  '
//      ' ##### '
//      '#######'

//   pyramid(5)
//      '    #    '
//      '   ###   '
//      '  #####  '
//      ' ####### '
//      '#########'

function pyramid(n) {

}

module.exports = pyramid;